{"src/common/commandExecutor":["Упаковщик остановлен","Упаковщик не найден"],"src/common/configurationProviderHelper":["Select platform","Platform to run on","Select type of React Native application","Type of React Native application","Use Hermes engine","Use Hermes engine for direct debugging?","Using Hermes engine is not confirmed","Select type of Expo host parameter","Type of Expo host parameter"],"src/common/packager":["Не удалось считать параметры упаковщика из exp.json, продолжение работы...","Запуск упаковщика","Упаковщик запущен.","Упаковщик уже запущен.","Упаковщик React Native выполняется вне VS Code. Если нужно выполнить отладку, выберите параметр \"Подключить к упаковщику\"","Упаковщик все еще выполняется. Если упаковщик был запущен извне VS Code, закройте процесс упаковщика с помощью диспетчера задач.","Упаковщик не запущен","Упаковщик все еще выполняется. Если упаковщик был запущен извне VS Code, закройте процесс упаковщика с помощью диспетчера задач.","Упаковщик не запущен","Точка входа не существует ни в index.js, ни в index.{0}.js. Пропуск предварительной подготовки...","Планируется получить: {0}","Кэш пакетов был предварительно подготовлен.","Не удалось запустить упаковщик.","Остановка упаковщика"],"src/common/error/errorStrings":["Ошибка при выполнении команды \"{0}\"","Ошибка при выполнении команды \"{0}\"","Команда \"{0}\" завершилась с кодом ошибки {1}","Ожидалось целое число. Не удалось прочитать {0}","Ошибка при выполнении упаковщика React Native.","Не удается найти ios-deploy. Установите его на глобальном уровне (\"npm install -g ios-deploy\")","Не удается подключить образ диска разработчика.","Не удается подключить образ диска разработчика.","An error occurred while launching the application. {0}","An error occurred while attaching debugger to the application. {0}","Истекло время ожидания при запуске приложения. Устройство заблокировано?","Не удается запустить симулятор iOS. Попробуйте указать другой целевой объект.","Не найдено расположение пакета Opn","Пакет \"opn\" не найден. {0}","Попытка найти пакет {0} завершилась ошибкой: {1}","Платформа \"{0}\" не поддерживается на платформе узла: {1}","Не удалось выполнить синтаксический анализ компонента версии пакета в {0}: версия = {1}","Версия проекта = {0}","Couldn't find React Native version in the current workspace or folder","Не удается считать версию = {0}","{0}. Не удалось инициализировать телеметрию","Не удалось активировать расширение \"Средства React Native\".","Не удалось установить средство запуска заглушек для отладчика","Не удалось настроить IntelliSense","Не удалось настроить расположение отладчика узла для отладчика.","Не удалось остановить упаковщик при закрытии Средств React Native.","Не удалось запустить приложение в Android","Не удалось запустить приложение в iOS","Не удалось запустить приложение в Expo","Не удалось запустить приложение в Expo","Не удалось запустить упаковщик React Native","Не удалось остановить упаковщик React Native","Не удалось перезапустить упаковщик React Native","Не удается выполнить отладку приложения","Не удается выполнить отладку приложения из-за ошибки во внутреннем отладчике узла","Не удалось удалить временную папку {0}","Не удалось найти расположение расширения отладчика узлов","Couldn't find any workspace or React Native project folder","Couldn't find react-native package in node_modules. Please, run \"npm install\" inside your project to install it.","It appears you don't have 'react-native-windows' package installed. Please proceed to https://github.com/microsoft/react-native-windows#getting-started for more info.","Не удается запустить упаковщик через порт {0}, так как процесс упаковщика уже выполняется через порт {1}","Ошибка при обработке сообщения: {0}","Не удается установить связь с расширением react-native VS Code. Это должен быть проект react-native, кроме того, вам нужно установить пакет npm react-native в корне.","Неизвестная ошибка: были сопоставлены не все шаблоны успешного выполнения. \n Это означает, что команда \"react-native run-{0}\" завершилась с ошибкой. \n Проверьте раздел \"Вид\" -> \"Переключить выходные данные\" -> \"React Native\", \n \"Вид\" -> \"Переключить выходные данные\" -> \"React Native\": запустите окна вывода {1}.","Не удалось выполнить синтаксический анализ компонента версии пакета в {0}: версия = {1}","Неподдерживаемое состояние команды","Компонент Expo не предоставил ссылку. Проект настроен правильно?","Ошибка при работе с рабочей областью: {0}","Версия React Native не поддерживается компонентом Expo. Поддерживаемые основные номера версии: {0}","Пользователь отменил вход.","Не удается подключить к упаковщику. Вы уверены, что существует упаковщик, работающий через порт {0}? Если упаковщик настроен для работы через другой порт, добавьте его в файл settings.json.","К упаковщику уже подключен другой отладчик. Закройте его, прежде чем пытаться выполнить отладку с помощью VS Code.","Похоже, что вы пытаетесь выполнить отладку из каталога, не являющегося корневым каталогом проекта React Native. \n Если это так, следуйте указанным инструкциям: https://github.com/microsoft/vscode-react-native/blob/master/doc/customization.md#project-structure.","Аргумент sourcesStoragePath имел значение null или был пуст","Не удалось установить приложение на любом из доступных устройств. Убедитесь в наличии \n правильно настроенного и работающего устройства или эмулятора. См. статью https://facebook.github.io/react-native/docs/android-setup.html.","Истекло время ожидания для команды оболочки Android. Повторите операцию.","Проект Android не найден.","Больше одного устройства/эмулятора","Не удалось запустить указанное действие. Попробуйте запустить приложение вручную и начать отладку с помощью конфигурации запуска \"Подключить к упаковщику\".","Найдено несколько исполняемых файлов в {0}. Очистите папку сборки или установите параметр запуска \"productName\".","Не удалось найти исполняемый файл в {0}","\"rnpm-plugin-windows\" не установлен.","React DevTools не установлен. Выполните команду \"npm install -g react-devtools\" в своем терминале, чтобы установить его.","Operation canceled","{0}. Отладка не будет работать: попробуйте перезагрузить JS изнутри приложения или переподключить отладчик VS Code","Сбой повторного подключения к прокси-серверу (упаковщику). Проверьте наличие ошибок упаковщика в окне вывода. Если ошибка повторяется, перезапустите отладчик React Native.","Не удалось обработать сообщение от приложения React Native. Сообщение:\n{0}","Не удалось подготовить среду выполнения JavaScript. Сообщение:\n{0}","Не удалось отправить сообщение в приложение React Native. Сообщение:\n{0}","Рабочий процесс React Native выдает ошибку","Не удалось импортировать скрипт в <{0}>","У RNMessage с методом \"executeApplicationScript\" нет свойства \"url\"","Could not connect to the debug target at {0}: {1}","Unable to find iOS target device/simulator. Please check that \"Settings > Safari > Advanced > Web Inspector = ON\" or try specifying a different \"port\" parameter in launch.json. Also, please make sure that 'target' property in your debug scenario is defined correctly.","The command \"emulator -avd {0}\" threw an exception: {1}","Virtual device launch finished with an exception: {0}","It appears you don't have 'react-native-macos' package installed. Please proceed to https://microsoft.github.io/react-native-windows/docs/rnm-getting-started for more info.","Error while starting monitoring LogCat","Error while stopping monitoring LogCat","No active Android LogCat monitors found","Could not start direct debugging of the {0} application without Hermes engine enabled. Please check if Hermes engine is enabled in your project and your debugging configuration contains 'useHermesEngine' prop set to 'true'"],"src/debugger/appWorker":["Закрыто подключение от прокси-сервера (упаковщика) к приложению React Native. Скоро будет предпринята повторная попытка переподключения...","Установлено подключение прокси-сервера (упаковщика) к приложению React Native"],"src/debugger/debugSessionBase":["Couldn't stop monitoring logcat: {0}"],"src/debugger/rnDebugSession":["Starting debugger app worker.","Debugger worker loaded runtime on port {0}"],"src/debugger/direct/directDebugSession":["Couldn't start child debug session"],"src/extension/VirtualDeviceManager":["Select virtual device for launch application"],"src/extension/appLauncher":["Prewarming bundle cache. This may take a while ...","Building and running application.","Prepare Hermes debugging (experimental)","Prepare Hermes launch (experimental)","Prepare direct iOS debugging (experimental)","Prepare direct iOS launch (experimental)","Disable JS Debugging","Enable JS Debugging","Continue using standard RN CLI workflow."],"src/extension/commandPaletteHandler":["Не удалось выполнить публикацию. Убедитесь, что вы вошли в Expo, а ваш проект является допустимым для Expo","Уже запущен другой инспектор элементов","Error while monitoring LogCat","Could not find a proper online Android device to start a LogCat monitor","Публикация приложения на сервер Expo. Это может занять некоторое время.","Приложение Expo успешно опубликовано в {0}","Произошла ошибка. Убедитесь, что вы вошли в Expo, ваш проект настроен правильно для публикации, а упаковщик работает как Expo."],"src/extension/generalMobilePlatform":["React Native: запуск {0}","Выполнено подключение к упаковщику. Теперь вы можете открыть приложение в симуляторе.","Отладчик готов. Включите удаленную отладку в приложении.","Отладчик готов. Отключите удаленную отладку в приложении.","Запуск упаковщика React Native.","Подключение к выполняемому упаковщику React Native"],"src/extension/openFileAtLocation":["Предоставлено неправильное количество параметров. См. описание этого скрипта, чтобы узнать о его правильном использовании."],"src/extension/packagerStatusIndicator":["Упаковщик React Native","Остановить упаковщик","Запустить упаковщик","Перезапустить упаковщик","Starting Packager","Stopping Packager"],"src/extension/qrCodeContentProvider":["Expo выполняется. Откройте свое приложение Expo в<br/><span style=\"text-decoration: underline\">{0}</span><br/>или отсканируйте QR-код ниже:"],"src/extension/rn-extension":["Extension version is not found","React Native Tools требуется установка React Native версии 0.19.0 или более поздней в <PROJECT_ROOT>/node_modules/","React Native: отображение меню разработчика для приложения","React Native: перезагрузка приложения","React Native: запуск инспектора элементов","React Native Tools: Both Stable and Preview extensions are installed. Stable will be used. Disable or remove it to work with Preview version.","React Native Tools have been updated to {0}","More details"],"src/extension/android/adb":["Не найдено значение sdk.dir в файле local.properties. Использование расположения пакета SDK для Android из переменной PATH.","Использование расположения пакета SDK для Android, определенного в файле android/local.properties: {0}.","Файл local.properties не существует. Использование расположения пакета SDK для Android из переменной PATH.","Не удалось выполнить чтение из {0}.","Использование расположения пакета SDK для Android из переменной PATH."],"src/extension/android/androidEmulatorManager":["Android emulator was launched from the Windows RDP session, this might lead to failures.","Could not start the emulator {0} within {1} seconds.","Launched emulator {0}","Select online Android device"],"src/extension/android/androidPlatform":["Целевой объект {0} не поддерживается для платформы Android. \n Если вы хотите использовать определенное устройство или симулятор для запуска приложения Android,\n укажите вместо этого идентификатор устройства (как в выходных данных \"adb devices\").","Устройство {0} поддерживает только уровень API {1}. \n Для поддержки перенаправления портов через adb reverse требуется уровень {2}. \n Чтобы отладка работала, нужно <Shake or press menu button> для меню разработки, \n перейти в <Dev Settings> и указать для параметра <Debug Server host & port for Device> \n IP-адрес компьютера, с которым устройство может связаться. Дополнительные сведения: \n https://facebook.github.io/react-native/docs/debugging.html#debugging-react-native-apps","Ошибка при мониторинге LogCat"],"src/extension/android/logCatMonitor":["Мониторинг LogCat остановлен, так как соответствующий процесс завершен.","Мониторинг LogCat остановлен, так как завершен сеанс отладки"],"src/extension/debuggingConfiguration/debugConfigTypesAndConstants":["Allows to deploy and debug an application by means of Expo cloud services","Allows to deploy and install an application via your LAN","Allows to debug an application on an emulator or an Android device without network connection"],"src/extension/debuggingConfiguration/launchJsonCompletionProvider":["Select a React Native debug configuration","Select a React Native debug configuration"],"src/extension/debuggingConfiguration/reactNativeDebugConfigProvider":["Run and debug Android application","Run Android application","Run and debug iOS application","Run iOS application","Run and debug Windows application","Run and debug macOS application","Attach to already working application packager","Debug Expo application or React Native application in Expo","Run and debug Android Hermes application","Run Android Hermes application","Run and debug iOS Hermes application","Run iOS Hermes application","Run and debug macOS Hermes application","Attach to already working React Native Hermes application on Android directly","Run and debug iOS application directly","Run iOS application with direct debugging support","Attach to already working React Native iOS application directly","Run React Native application without debugging","Debug React Native application","Attach to running React Native application","Select a debug configuration","Pick debug configurations"],"src/extension/debuggingConfiguration/configurationProviders/attachConfigProvider":["The address of the host","Enter the address of the host","Enter a valid host name or IP address","The port of the host","Enter the port number that the debug server is listening on","Enter a valid port number"],"src/extension/experimentService/experimentsStrings":["Want to help us improve the React Native Tools Extension? Install the Preview version and give us feedback!"],"src/extension/exponent/exponentHelper":["Проверка правильности зависимостей для Expo, используемых проектом. Это может занять некоторое время...","Проверка того, является ли это приложение приложением Expo.","[Предупреждение] Убедитесь, что пакет expo установлен локально для вашего проекта, в противном случае могут возникнуть ошибки. Чтобы установить пакет, выполните команду \"npm install expo --save-dev\" внутри вашего проекта.","Вам нужно войти в Expo. Закрыв это окно, введите имя пользователя и пароль учетной записи Expo в полях ввода. Если у вас нет учетной записи, перейдите на страницу https://expo.io, чтобы создать ее.","Имя пользователя Expo","Пароль Expo"],"src/extension/exponent/exponentPlatform":["A device or an emulator was found, 'adb reverse' command successfully executed.","Adb reverse command failed. Couldn't find connected over usb device or running emulator. Also please make sure that there is only one currently connected device or running emulator.","Expo server is running. Open your Expo app at {0} to see it.","Copy to clipboard","Приложение выполняется в Expo. Встряхните устройство и выберите \"Удаленная отладка JS\" для включения отладки."],"src/extension/ios/iOSDebugModeManager":["Не удается найти файл PLIST для настройки отладки"],"src/extension/ios/iOSPlatform":["Параметр \"iosRelativeProjectPath\" является нерекомендуемым. Используйте вместо него \"runArguments\".","\"--scheme\" установлено в качестве значения параметра конфигурации \"runArguments\"; значение параметра конфигурации \"scheme\" будет пропущено."],"src/extension/ios/iOSSimulatorManager":["Select system version of iOS virtual device"],"src/extension/ios/simulatorPlist":["Найдено несколько подходящих файлов PLIST. Возможно, приложение не находится в режиме отладки."],"src/extension/windows/wpfPlatform":["Отладка платформы WPF не поддерживается для этой версии react-native-windows ({0})"]}