{"src/common/commandExecutor":["Empacotador interrompido","Empacotador não encontrado"],"src/common/configurationProviderHelper":["Select platform","Platform to run on","Select type of React Native application","Type of React Native application","Use Hermes engine","Use Hermes engine for direct debugging?","Using Hermes engine is not confirmed","Select type of Expo host parameter","Type of Expo host parameter"],"src/common/packager":["Não foi possível ler as opções do empacotador de exp.json, continuar...","Iniciando o Empacotador","Empacotador iniciado.","O empacotador já está em execução.","O Empacotador React Native está em execução fora do VS Code. Se deseja depurar, use a opção 'Anexar ao empacotador'","O empacotador ainda está em execução. Se o empacotador foi iniciado fora do VS Code, encerre o processo do empacotador usando o gerenciador de tarefas.","O empacotador não está em execução","O empacotador ainda está em execução. Se o empacotador foi iniciado fora do VS Code, encerre o processo do empacotador usando o gerenciador de tarefas.","O empacotador não está em execução","O ponto de entrada não existe no index.js nem no index.{0}.js. Ignorar pré-aquecimento...","Prestes a obter: {0}","O Cache do Conjunto foi pré-aquecido.","Não foi possível iniciar o empacotador.","Parando o Empacotador"],"src/common/error/errorStrings":["Erro ao executar o comando '{0}'","Erro ao executar o comando '{0}'","Falha no comando '{0}' com o código de erro {1}","Esperado um inteiro. Não foi possível ler {0}","Erro ao executar o Empacotador React Native.","Não é possível localizar o ios-deploy. Instale-o globalmente ('npm install -g ios-deploy')","Não é possível montar a imagem do disco do desenvolvedor.","Não é possível montar a imagem do disco do desenvolvedor.","An error occurred while launching the application. {0}","An error occurred while attaching debugger to the application. {0}","Tempo limite atingido ao iniciar o aplicativo. O dispositivo está bloqueado?","Não é possível iniciar o simulador do iOS. Tente especificar um destino diferente.","Local do pacote Opn não encontrado","O pacote 'opn' não foi encontrado. {0}","Falha na tentativa de localizar o pacote {0} com o erro: {1}","A plataforma '{0}' não é compatível com a plataforma do host: {1}","Não foi possível analisar o componente de versão do pacote em {0}: versão = {1}","Versão do projeto = {0}","Couldn't find React Native version in the current workspace or folder","Não é possível ler a versão = {0}","{0}. Não foi possível inicializar a telemetria","Falha ao ativar a extensão Ferramentas React Native","Falha ao configurar o iniciador de stub para o depurador","Falha ao configurar o IntelliSense","Falha ao configurar o local do depurador de nó para o depurador","Falha ao parar o empacotador ao fechar as Ferramentas React Native","Falha ao executar o aplicativo no Android","Falha ao executar o aplicativo no iOS","Falha ao executar o aplicativo no Expo","Falha ao executar o aplicativo no Expo","Falha ao iniciar o empacotador React Native","Falha ao parar o empacotador React Native","Falha ao reiniciar o empacotador React Native","Não é possível depurar o aplicativo","Não é possível depurar o aplicativo devido a um erro no Depurador do Node interno","Não foi possível excluir a pasta temporária {0}","Não foi possível encontrar o local da extensão node-debugger","Couldn't find any workspace or React Native project folder","Couldn't find react-native package in node_modules. Please, run \"npm install\" inside your project to install it.","It appears you don't have 'react-native-windows' package installed. Please proceed to https://github.com/microsoft/react-native-windows#getting-started for more info.","Um empacotador não pode ser iniciado na porta {0} porque um processo de empacotador já está em execução na porta {1}","Erro ao manipular a mensagem: {0}","Não é possível configurar a comunicação com a extensão react-native do VSCode. Este é um projeto react-native? Você verificou se o pacote npm do react-native está instalado na raiz?","Erro desconhecido: nem todos os padrões de sucesso corresponderam. \n Isso significa que o comando \"react-native run-{0}\" falhou. \n Verifique as janelas de saída Exibição -> Ativar/desativar Saída -> React Native, \n Exibição -> Ativar/desativar Saída -> React Native: executar {1}.","Não foi possível analisar o componente de versão do pacote em {0}: versão = {1}","Status do comando sem suporte","Não foi fornecido nenhum link pelo Expo. O projeto está configurado corretamente?","Erro ao trabalhar com o workspace: {0}","A versão do React Native não é compatível com o Expo. Versões principais compatíveis: {0}","Logon cancelado pelo usuário.","Não é possível anexar ao empacotador. Tem certeza de que há um empacotador e que ele está em execução na porta {0}? Se o empacotador estiver configurado para ser executado em outra porta, adicione-a ao settings.json.","Outro depurador já está conectado ao empacotador. Feche-o antes de tentar a depuração com o VSCode.","Parece que você está tentando depurar de dentro de um diretório que não é uma raiz do projeto React Native. \n Em caso afirmativo, siga estas instruções: https://github.com/microsoft/vscode-react-native/blob/master/doc/customization.md#project-structure.","O argumento sourcesStoragePath era nulo ou estava vazio","Não foi possível instalar o aplicativo em nenhum dispositivo disponível. Verifique se há um dispositivo ou emulador configurado \n corretamente em execução. Confira https://facebook.github.io/react-native/docs/android-setup.html.","Um comando do shell do Android atingiu o tempo limite. Repita a operação.","Projeto do Android não encontrado.","Mais de um dispositivo/emulador","Falha ao iniciar a atividade especificada. Tente executar o aplicativo manualmente e iniciar a depuração usando a configuração de inicialização 'Anexar ao empacotador'.","Foram encontrados mais de um executáveis em {0}. Limpe a pasta de build ou configure a opção de inicialização 'productName'.","Não foi possível encontrar o executável em {0}","O 'rnpm-plugin-windows' não está instalado.","O React Devtools não está instalado. Execute o comando `npm install -g react-devtools` no terminal para instalá-lo.","Operation canceled","{0}. A depuração não funcionará: tente recarregar o JS de dentro do aplicativo ou Reconectar o depurador do VS Code","Falha na reconexão com o proxy (Empacotador). Verifique se na janela de Saída há algum erro do Empacotador. Se a falha persistir, reinicie o depurador React Native.","Falha ao processar a mensagem do aplicativo React Native. Mensagem:\n{0}","Falha ao preparar o ambiente de tempo de execução do JavaScript. Mensagem:\n{0}","Falha ao enviar a mensagem para o aplicativo React Native. Mensagem:\n{0}","O processo de trabalho do React Native gerou um erro","Não foi possível importar o script em <{0}>","A RNMessage com o método 'executeApplicationScript' não tem a propriedade 'url'","Could not connect to the debug target at {0}: {1}","Unable to find iOS target device/simulator. Please check that \"Settings > Safari > Advanced > Web Inspector = ON\" or try specifying a different \"port\" parameter in launch.json. Also, please make sure that 'target' property in your debug scenario is defined correctly.","The command \"emulator -avd {0}\" threw an exception: {1}","Virtual device launch finished with an exception: {0}","It appears you don't have 'react-native-macos' package installed. Please proceed to https://microsoft.github.io/react-native-windows/docs/rnm-getting-started for more info.","Error while starting monitoring LogCat","Error while stopping monitoring LogCat","No active Android LogCat monitors found","Could not start direct debugging of the {0} application without Hermes engine enabled. Please check if Hermes engine is enabled in your project and your debugging configuration contains 'useHermesEngine' prop set to 'true'"],"src/debugger/appWorker":["O Proxy (Empacotador) foi desconectado do aplicativo React Native. A reconexão será repetida em breve...","Uma conexão foi estabelecida entre o Proxy (Empacotador) e o aplicativo React Native"],"src/debugger/debugSessionBase":["Couldn't stop monitoring logcat: {0}"],"src/debugger/rnDebugSession":["Starting debugger app worker.","Debugger worker loaded runtime on port {0}"],"src/debugger/direct/directDebugSession":["Couldn't start child debug session"],"src/extension/VirtualDeviceManager":["Select virtual device for launch application"],"src/extension/appLauncher":["Prewarming bundle cache. This may take a while ...","Building and running application.","Prepare Hermes debugging (experimental)","Prepare Hermes launch (experimental)","Prepare direct iOS debugging (experimental)","Prepare direct iOS launch (experimental)","Disable JS Debugging","Enable JS Debugging","Continue using standard RN CLI workflow."],"src/extension/commandPaletteHandler":["A publicação foi malsucedida. Verifique se você está conectado ao Expo e se o projeto é um projeto Expo válido","Outro inspetor de elementos já foi executado","Error while monitoring LogCat","Could not find a proper online Android device to start a LogCat monitor","Publicando aplicativo no servidor Expo. Isso pode demorar um pouco.","O aplicativo Expo foi publicado com êxito em {0}","Erro. Verifique se você está conectado ao Expo, se o projeto está configurado corretamente para a publicação e se o empacotador está sendo executado como Expo."],"src/extension/generalMobilePlatform":["React Native: executar {0}","Conectado ao empacotador. Agora você pode abrir o aplicativo no simulador.","Depurador pronto. Habilite a depuração remota no aplicativo.","Depurador pronto. Desabilite a depuração remota no aplicativo.","Iniciando o Empacotador React Native.","Anexando ao empacotador React Native em execução"],"src/extension/openFileAtLocation":["Número incorreto de parâmetros fornecido. Veja o uso desse script para saber como usá-lo corretamente."],"src/extension/packagerStatusIndicator":["Empacotador React Native","Parar Empacotador","Iniciar Empacotador","Reiniciar Empacotador","Starting Packager","Stopping Packager"],"src/extension/qrCodeContentProvider":["O Expo está em execução. Abra o aplicativo Expo em<br/><span style=\"text-decoration: underline\">{0}</span><br/>ou verifique o código QR abaixo:"],"src/extension/rn-extension":["Extension version is not found","O React Native Tools precisa do React Native versão 0.19.0 ou posterior para ser instalado em <PROJECT_ROOT>/node_modules/","React Native: mostrar o Menu do Desenvolvedor do aplicativo","React Native: recarregar Aplicativo","React Native: executar Inspetor de Elementos","React Native Tools: Both Stable and Preview extensions are installed. Stable will be used. Disable or remove it to work with Preview version.","React Native Tools have been updated to {0}","More details"],"src/extension/android/adb":["Não foi encontrado nenhum valor de sdk.dir no arquivo local.properties. Usando o local do SDK do Android do CAMINHO.","Usando o local do SDK do Android definido no arquivo android/local.properties: {0}.","O arquivo local.properties não existe. Usando o local do SDK do Android do CAMINHO.","Não foi possível ler de {0}.","Usando o local do SDK do Android do CAMINHO."],"src/extension/android/androidEmulatorManager":["Android emulator was launched from the Windows RDP session, this might lead to failures.","Could not start the emulator {0} within {1} seconds.","Launched emulator {0}","Select online Android device"],"src/extension/android/androidPlatform":["O destino {0} não é compatível com a plataforma Android. \n Se você deseja usar um dispositivo ou simulador específico para iniciar o aplicativo Android, \n especifique a ID do dispositivo (como na saída 'adb devices').","O dispositivo {0} é compatível apenas com o Nível da API {1}. \n O Nível {2} é necessário para dar suporte ao encaminhamento de porta por adb reverso. \n Para que a depuração funcione, você precisará <Agitar ou pressionar o botão de menu> do menu de desenvolvimento, \n acessar as <Configurações de Desenvolvimento> e configurar o <host e a porta do Servidor de Depuração do Dispositivo> como \n um endereço IP do computador que o Dispositivo pode acessar. Mais informações em: \n https://facebook.github.io/react-native/docs/debugging.html#debugging-react-native-apps","Erro ao monitorar o LogCat"],"src/extension/android/logCatMonitor":["O monitoramento de LogCat parou porque o processo foi encerrado.","O monitoramento de LogCat parou porque a sessão de depuração foi concluída"],"src/extension/debuggingConfiguration/debugConfigTypesAndConstants":["Allows to deploy and debug an application by means of Expo cloud services","Allows to deploy and install an application via your LAN","Allows to debug an application on an emulator or an Android device without network connection"],"src/extension/debuggingConfiguration/launchJsonCompletionProvider":["Select a React Native debug configuration","Select a React Native debug configuration"],"src/extension/debuggingConfiguration/reactNativeDebugConfigProvider":["Run and debug Android application","Run Android application","Run and debug iOS application","Run iOS application","Run and debug Windows application","Run and debug macOS application","Attach to already working application packager","Debug Expo application or React Native application in Expo","Run and debug Android Hermes application","Run Android Hermes application","Run and debug iOS Hermes application","Run iOS Hermes application","Run and debug macOS Hermes application","Attach to already working React Native Hermes application on Android directly","Run and debug iOS application directly","Run iOS application with direct debugging support","Attach to already working React Native iOS application directly","Run React Native application without debugging","Debug React Native application","Attach to running React Native application","Select a debug configuration","Pick debug configurations"],"src/extension/debuggingConfiguration/configurationProviders/attachConfigProvider":["The address of the host","Enter the address of the host","Enter a valid host name or IP address","The port of the host","Enter the port number that the debug server is listening on","Enter a valid port number"],"src/extension/experimentService/experimentsStrings":["Want to help us improve the React Native Tools Extension? Install the Preview version and give us feedback!"],"src/extension/exponent/exponentHelper":["Verifique se o projeto usa as dependências corretas para Expo. Isso pode demorar um pouco...","Verificando se esse é um aplicativo Expo.","[Aviso] Verifique se esse pacote expo está instalado localmente no seu projeto. Caso contrário, poderão ocorrer mais erros. Execute \"npm install expo --save-dev\" dentro do projeto para instalá-lo.","Você deve entrar no Expo. Forneça o nome de usuário e a senha da conta do Expo nas caixas de entrada depois de fechar esta janela. Se você não tiver uma conta, acesse https://expo.io para criar uma.","Nome de usuário do Expo","Senha do Expo"],"src/extension/exponent/exponentPlatform":["A device or an emulator was found, 'adb reverse' command successfully executed.","Adb reverse command failed. Couldn't find connected over usb device or running emulator. Also please make sure that there is only one currently connected device or running emulator.","Expo server is running. Open your Expo app at {0} to see it.","Copy to clipboard","O aplicativo está em execução no Expo. Agite o dispositivo e selecione 'Depurar JS Remotamente' para habilitar a depuração."],"src/extension/ios/iOSDebugModeManager":["Não é possível localizar o arquivo plist para configurar a depuração"],"src/extension/ios/iOSPlatform":["A opção 'iosRelativeProjectPath' foi preterida. Nesse caso, use 'runArguments'.","'--scheme' está definido como valor do parâmetro de configuração 'runArguments'. O valor do parâmetro de configuração 'scheme' será omitido"],"src/extension/ios/iOSSimulatorManager":["Select system version of iOS virtual device"],"src/extension/ios/simulatorPlist":["Foram encontrados vários candidatos à plist. O aplicativo não pode estar no modo de depuração."],"src/extension/windows/wpfPlatform":["Não há suporte para a depuração da plataforma WPF nesta versão ({0}) do react-native-windows"]}